In [2]:
import pandas as pd

# Load a Tabula Dataset

In [8]:
sf = pd.read_csv('people-example.csv')
sf

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [10]:
sf['age'].mean()

23.142857142857142

# Create New Columns in DataFrame

In [11]:
sf['Full Name'] = sf['First Name'] + ' ' + sf['Last Name']

In [12]:
sf

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown            USA   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

# Use the apply function to do a advance transformation of data

In [13]:
def transform_country(country):
    if country == 'USA':
        return 'United States'
    else:
        return country

In [14]:
transform_country('Brazil')

'Brazil'

In [15]:
transform_country('USA')

'United States'

In [16]:
sf['Country'].apply(transform_country)

0    United States
1           Canada
2          England
3    United States
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [17]:
sf['Country'] = sf['Country'].apply(transform_country)
sf

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown  United States   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward